Autodesk.Revit.DB.IAXMImporterServer.ImportAXM(Autodesk.Revit.AXMImporterServiceData)
The method that Revit will invoke to perform AXM import.
data:
The AXM import data.
Returns:
Indicates whether the AXM importer server is executed successfully.

Autodesk.Revit.DB.IAXMImporterServer
Interface for external servers implementing AXM import.